АвтосервисАвтомагазин/src/Catalogs/КА2_НаименованияМоделей/КА2_НаименованияМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КА2_НаименованияМоделей</name>
</mdclass:Catalog>

АвтосервисАвтомагазин/src/Catalogs/КА2_Модели/КА2_Модели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КА2_Модели</name>
  <owners>Catalog.КА2_НаименованияМоделей</owners>
  <attributes>
    <name>id_car_mark</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>name_rus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>date_create</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>date_update</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_car_type</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АвтосервисАвтомагазин/src/Catalogs/КА2_НаименованияМоделей/ManagerModule.bsl
// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Обновить() Экспорт

КонецФункции

// Возвращает дополнительные данные для элемента справочника КА2_НаименованияМоделей
// 
// Параметры:
// 	Ссылка - СправочникСсылка.КА2_НаименованияМоделей - наименование модели ТС
// Возвращаемое значение:
// 	Структура - Описание: дополнительные данные
// * Модель - СправочникСсылка.КА2_Модели - Модель ТС 
// * ТипТС - СправочникСсылка.КА2_Типы - Тип ТС
// * Модель - Неопределено - ошибка определения модели ТС
// * ТипТС - Неопределено - ошибка определения типа ТС
Функция ДополнительныеДанные(Ссылка) Экспорт

	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("ТипТС", Неопределено);
	ДополнительныеДанные.Вставить("Модель", Неопределено);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	КА2_Типы.Ссылка КАК ТипТС,
				   |	КА2_Модели.Ссылка КАК Модель
				   |ИЗ
				   |	Справочник.КА2_Модели КАК КА2_Модели
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КА2_Типы КАК КА2_Типы
				   |		ПО КА2_Типы.Код = КА2_Модели.id_car_type
				   |ГДЕ
				   |	КА2_Модели.Владелец = &Владелец
				   |УПОРЯДОЧИТЬ ПО
				   |	КА2_Модели.date_create УБЫВ";
	Запрос.УстановитьПараметр("Владелец", Ссылка);

	КоллекцияМоделей = Запрос.Выполнить().Выбрать();
	Если КоллекцияМоделей.Количество() > 0 Тогда
		КоллекцияМоделей.Следующий();
		ДополнительныеДанные.Вставить("ТипТС", КоллекцияМоделей.ТипТС);
		ДополнительныеДанные.Вставить("Модель", КоллекцияМоделей.Модель);
	КонецЕсли;

	Возврат ДополнительныеДанные;

КонецФункции

#КонецОбласти

#КонецЕсли
